function dphi=FHN_hoi2(t,phi,L,I)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%需要差分的函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
N = length(L); % 网络中振子的数量

u=phi(1:N,1);
v=phi((N+1):end,1);

% parameters of the units
a = 3;
b = 2;
c = 1;
epsilon = 1;
sigma = 1;

% ------------------------------
% 计算局部动力学项
% ------------------------------
f = c * (u - (u.^3)/3 - v);
g = c * (a*u - b*v);

% ------------------------------
% 计算网络耦合项
% ------------------------------
coupling_u = epsilon * (L * u);
coupling_v = sigma * epsilon * (L * v);

% ------------------------------
% 合成导数
% ------------------------------
du = f + coupling_u+I(1:N);
dv = g + coupling_v;
dphi=[du;dv];

end

